hrlHet/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.0                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
  version     2.0;
  format      ascii;
  class       dictionary;
  location    "constant";
  object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

transportModel  Newtonian;

Dm             DT   [0 2 -1 0 0 0 0]   1e-4; // 1/Ra;
beta           beta [0 0 0 0 0 0 0]    1.;
hydrostaticPressure on;
concentrationBased off;
dispersionModel off;
incompressible on;

densityModel
{
  type      linearDensity;
  rho0  5.;
  beta  1.;
}

viscosityModel
{
  type constantViscosity;
  mu0  1.;
}
// ************************************************************************* //
